
#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.ssh_key: Refreshing state... [id=afe54254fa2921f6f6aeaba2d2d378a690c215e6]
azurerm_resource_group.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust]
azurerm_virtual_network.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/virtualNetworks/vnet-rust]
azurerm_recovery_services_vault.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.RecoveryServices/vaults/rust-recovery-vault]
azurerm_log_analytics_workspace.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.OperationalInsights/workspaces/rust-law]
azurerm_public_ip.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/publicIPAddresses/pip-rust]
azurerm_network_security_group.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/networkSecurityGroups/nsg-rust]
azurerm_subnet.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/virtualNetworks/vnet-rust/subnets/snet-internal]
azurerm_subnet_network_security_group_association.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/virtualNetworks/vnet-rust/subnets/snet-internal]
azurerm_network_interface.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/networkInterfaces/nic-rust]
azurerm_backup_policy_vm.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.RecoveryServices/vaults/rust-recovery-vault/backupPolicies/rust-recovery-vault-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_backup_protected_vm.vm1 will be created
  + resource "azurerm_backup_protected_vm" "vm1" {
      + backup_policy_id    = "/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.RecoveryServices/vaults/rust-recovery-vault/backupPolicies/rust-recovery-vault-policy"
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "rust-recovery-vault"
      + resource_group_name = "rust"
      + source_vm_id        = (known after apply)
    }

  # azurerm_linux_virtual_machine.rust will be created
  + resource "azurerm_linux_virtual_machine" "rust" {
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "rust"
      + network_interface_ids                                  = [
          + "/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/networkInterfaces/nic-rust",
        ]
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rust"
      + size                                                   = "Standard_B2as_v2"
      + virtual_machine_id                                     = (known after apply)

      + admin_ssh_key {
          + public_key = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC86BXGwX9tm05lwNOLJEknepsMmTZNw4ZiS0KtbP/R4ZFXf+BZkFwjqXIYo6TilXtt3wOSTm3gOVtPyZcLx48YBZ8Oo6f4WmNpveQU1bR0F8elma+r6Ysosr07lDMIeFbp/ksaRn1He0Qi7fQRrNZm2D9i+iVg5Yggfos10YcMN7VS30xvPo0vDR+InpddP5KL0fbmFThQXDxUuUxYkdCCyQmyarC+aXttOtAhBCcTVsiqgqFtnmHlrGe0vYI91FB9YEpnLxxda9ZUZonWCRmP7Zph/RIF0l8jOQZBzJNJlcDy4JUQEqqdBstGmgtISJV6Vfl8QKzGsvX1PRWtu3ZfJ1VTVLuURoENwyfKiMSlErParnfoBKPnJgr0PJTXsQxCFHZgyjbCh9U2w4Lh79Fmqxod2RSZ5LKkAq05VXFk/dxZm4OPFeKASJrGd83x8ki6HV30a/p7c6u8uZCBpQc/hx2+r+QmT/NDpRExz8ElzAJBnoJYppkXHe/hZczIBAOiqhjakHRSDGuTzZOMtkCHZOxTnsNcXGY7bqKLENZwFu4Nzz7AwmKk/OIsIqrEGaHxKdsGWgLgnnrxARjdfX7VirJa0FyQ54wq8p4mxpctG/iq4Er8nfpa2Dw27++MIkuF/6CHEyqAj9pGqgk82FExhkpQSdqKOicKrLjeV6RT5w==
            EOT
          + username   = "adminuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @robpitcher, Action: `pull_request`, Workflow: `Terraform Plan/Apply`*